share/tutorials/heat-transfer/buoyant-simple/circuit_board_cooling/0.org/T
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       volScalarField;
  location    "0";
  object      T;
}

dimensions      [0 0 0 1 0 0 0];
internalField   uniform 300;

boundaryField
{
  floor
  {
    type            zeroGradient;
  }
  ceiling
  {
    type            zeroGradient;
  }
  inlet
  {
    type            fixedValue;
    value           uniform 300;
  }
  outlet
  {
    type            inletOutlet;
    inletValue      uniform 300;
    value           uniform 300;
  }
  fixedWalls
  {
    type            empty;
  }
  processor
  {
    type            processor;
    value           $internalField;
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
