share/tutorials/heat-transfer/buoyant-simple/circuit_board_cooling/0.org/alphat
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       volScalarField;
  location    "0";
  object      alphat;
}

dimensions      [1 -1 -1 0 0 0 0];
internalField   uniform 0;

boundaryField
{
  //- Set patchGroups for constraint patches
  #includeEtc "caseDicts/setConstraintTypes"
  floor
  {
    type            compressible::alphatWallFunction;
    Prt             0.85;
    value           uniform 0;
  }
  ceiling
  {
    type            compressible::alphatWallFunction;
    Prt             0.85;
    value           uniform 0;
  }
  inlet
  {
    type            calculated;
    value           uniform 0;
  }
  outlet
  {
    type            calculated;
    value           uniform 0;
  }
  fixedWalls
  {
    type            empty;
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
