share/tutorials/heat-transfer/buoyant-simple/circuit_board_cooling/0.org/baffle3DRegion/Q
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       volScalarField;
  object      Q;
}

dimensions      [1 -1 -3 0 0 0 0];
internalField   uniform 17000;

boundaryField
{
  ".*"
  {
    type            zeroGradient;
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
