share/tutorials/heat-transfer/buoyant-simple/circuit_board_cooling/0.org/epsilon
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       volScalarField;
  location    "0";
  object      epsilon;
}

dimensions      [0 2 -3 0 0 0 0];
internalField   uniform 0.01;

boundaryField
{
  //- Set patchGroups for constraint patches
  #includeEtc "caseDicts/setConstraintTypes"
  floor
  {
    type            epsilonWallFunction;
    Cmu             0.09;
    kappa           0.41;
    E               9.8;
    value           uniform 0.01;
  }
  ceiling
  {
    type            epsilonWallFunction;
    Cmu             0.09;
    kappa           0.41;
    E               9.8;
    value           uniform 0.01;
  }
  inlet
  {
    type            fixedValue;
    value           uniform 0.01;
  }
  outlet
  {
    type            zeroGradient;
  }
  fixedWalls
  {
    type            empty;
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
